In [1]:
#We will now discuss arithmetic between and alignment of data in pandas data structures

import pandas as pd
import numpy as np
from pandas import DataFrame, Series

In [3]:
series_obj1 = Series(np.arange(1,5.), index=['a','b','c','d'])
series_obj2 = Series(np.arange(4,10.), index=['a','c','d','e','f','h'])

In [4]:
series_obj1

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [5]:
series_obj2

a    4.0
c    5.0
d    6.0
e    7.0
f    8.0
h    9.0
dtype: float64

In [7]:
#Now we can add the results of both series into a single series using + operator

series_obj1 + series_obj2
#where only the indexes common in both will add up whereas other indices will represent NaN values

a     5.0
b     NaN
c     8.0
d    10.0
e     NaN
f     NaN
h     NaN
dtype: float64

In [10]:
frame_obj1 = DataFrame([[1,2,3],[3,4,5]], columns = ['First','Second','Third'], index = ['A','B'])
frame_obj1

   First  Second  Third
A      1       2      3
B      3       4      5

In [11]:
frame_obj2 = DataFrame([[5,6,7],[7,8,9]], columns = ['Second','Third','Fourth'], index = ['B','A'])
frame_obj2

   Second  Third  Fourth
B       5      6       7
A       7      8       9

In [14]:
#Adding dataframes
frame_obj1 + frame_obj2

   First  Fourth  Second  Third
A    NaN     NaN       9     11
B    NaN     NaN       9     11

In [16]:
#We can refill the values using the fill_value argument in the add method and replace all the NaN values to 0

frame_obj2.add(frame_obj1, fill_value = 0)

   First  Fourth  Second  Third
A    1.0     9.0       9     11
B    3.0     7.0       9     11

In [17]:
#Now other arithmetic methods for dataframes and series are:

#Subtract: sub
#Series
series_obj3 = series_obj1.sub(series_obj2, fill_value = 0)
series_obj3

a   -3.0
b    2.0
c   -2.0
d   -2.0
e   -7.0
f   -8.0
h   -9.0
dtype: float64

In [18]:
#DataFrame
frame_obj3 = frame_obj1.sub(frame_obj2, fill_value = 0)
frame_obj3

   First  Fourth  Second  Third
A    1.0    -9.0      -5     -5
B    3.0    -7.0      -1     -1

In [19]:
#Multiply: mul
#Series
series_obj3 = series_obj1.mul(series_obj2, fill_value = 1)
series_obj3

a     4.0
b     2.0
c    15.0
d    24.0
e     7.0
f     8.0
h     9.0
dtype: float64

In [20]:
#DataFrame
frame_obj3 = frame_obj1.mul(frame_obj2, fill_value = 1)
frame_obj3

   First  Fourth  Second  Third
A    1.0     9.0      14     24
B    3.0     7.0      20     30

In [21]:
#Divide: div
#Series
series_obj3 = series_obj1.div(series_obj2, fill_value = 1)
series_obj3

a    0.250000
b    2.000000
c    0.600000
d    0.666667
e    0.142857
f    0.125000
h    0.111111
dtype: float64

In [22]:
#DataFrame
frame_obj3 = frame_obj1.div(frame_obj2, fill_value = 1)
frame_obj3

   First    Fourth    Second     Third
A    1.0  0.111111  0.285714  0.375000
B    3.0  0.142857  0.800000  0.833333

In [23]:
#Operations between DataFrame and Series
#Broadcasting Operations

frame = DataFrame(np.arange(16.).reshape(4,4), columns = ['First','Second','Third','Fourth'], index=list('acef'))
frame

   First  Second  Third  Fourth
a    0.0     1.0    2.0     3.0
c    4.0     5.0    6.0     7.0
e    8.0     9.0   10.0    11.0
f   12.0    13.0   14.0    15.0

In [25]:
series = frame.iloc[0]
series

First     0.0
Second    1.0
Third     2.0
Fourth    3.0
Name: a, dtype: float64

In [26]:
#Now for basic operations
frame - series

   First  Second  Third  Fourth
a    0.0     0.0    0.0     0.0
c    4.0     4.0    4.0     4.0
e    8.0     8.0    8.0     8.0
f   12.0    12.0   12.0    12.0

In [29]:
#In case an index does not match the series, it results in a NaN value. Same goes in case series does not match any dataframe index

series2 = Series(range(3),index=['First','Fourth','Sixth'])
series2

First     0
Fourth    1
Sixth     2
dtype: int64

In [30]:
series2 + frame

   First  Fourth  Second  Sixth  Third
a    0.0     4.0     NaN    NaN    NaN
c    4.0     8.0     NaN    NaN    NaN
e    8.0    12.0     NaN    NaN    NaN
f   12.0    16.0     NaN    NaN    NaN

In [31]:
series3 = frame['Third']
series3

a     2.0
c     6.0
e    10.0
f    14.0
Name: Third, dtype: float64

In [32]:
#Now to broadcast over the column, matching the rows then:
frame.sub(series3, axis = 0)
#where axis represents the axis to match on

   First  Second  Third  Fourth
a   -2.0    -1.0    0.0     1.0
c   -2.0    -1.0    0.0     1.0
e   -2.0    -1.0    0.0     1.0
f   -2.0    -1.0    0.0     1.0